---
kind: property
id: P:Autodesk.Revit.UI.RevitCommandId.Id
source: html/b8efe78c-07c8-4646-507d-4c9ed07f76be.htm
---
# Autodesk.Revit.UI.RevitCommandId.Id Property

The command id.

## Syntax (C#)
```csharp
public uint Id { get; }
```